docs/diagrams/create-import-request.puml
@startuml

title Series import flow: stage 1 (create import request)
hide footbox

participant Browser
participant SeriesImportController
participant SeriesImportService
participant EventPublisher

note over Browser,SeriesImportController: request import series form
opt GET /series/import/request
Browser->SeriesImportController:
activate SeriesImportController
SeriesImportController->Browser: RequestSeriesImportForm
deactivate SeriesImportController
end

note over Browser,SeriesImportController: submit request for importing a series
opt POST /series/import/request

Browser->SeriesImportController: RequestSeriesImportForm
activate SeriesImportController

SeriesImportController->SeriesImportService: RequestSeriesImportForm
activate SeriesImportService
SeriesImportService->SeriesImportController: requestId
deactivate SeriesImportService
note right of SeriesImportService: Unprocessed
SeriesImportController->EventPublisher: ImportRequestCreated

SeriesImportController->Browser: redirect to /series/import/request/{id}
deactivate SeriesImportController

end

@enduml
