docs/import-series-flow.md
```mermaid
sequenceDiagram
	title Series import flow: stage 3 (parse page)

	participant DownloadingSucceededEventListener
	participant SiteParserService
	participant SeriesImportService
	participant SiteParser
	participant ExtractorService
	participant SeriesSalesImportService
	participant EventPublisher

	DownloadingSucceededEventListener->>SiteParserService: page URL
	activate SiteParserService
	SiteParserService->>DownloadingSucceededEventListener: site parser
	deactivate SiteParserService
	DownloadingSucceededEventListener->>SeriesImportService: requestId
	activate SeriesImportService
	SeriesImportService->>DownloadingSucceededEventListener: content of downloaded page
	deactivate SeriesImportService
	DownloadingSucceededEventListener->>SiteParser: content of downloaded page
	activate SiteParser
	SiteParser->>DownloadingSucceededEventListener: SeriesInfo
	deactivate SiteParser
	DownloadingSucceededEventListener->>ExtractorService: RawParsedDataDto
	activate ExtractorService
	ExtractorService->>DownloadingSucceededEventListener: SeriesExtractedInfo
	deactivate ExtractorService
	alt
	DownloadingSucceededEventListener->>SeriesImportService: SeriesExtractedInfo
	activate SeriesImportService
	alt
	SeriesImportService-->>SeriesSalesImportService: SeriesSalesParsedDataDbDto
	activate SeriesSalesImportService
	SeriesSalesImportService-->>SeriesImportService: 
	deactivate SeriesSalesImportService
	SeriesImportService->>SeriesImportService: 
	note right of SeriesImportService: DownloadingSucceeded -> ParsingSucceeded
	else
	SeriesImportService->>EventPublisher: ParsingFailed
	end
	SeriesImportService->>DownloadingSucceededEventListener: 
	deactivate SeriesImportService
	else
	DownloadingSucceededEventListener->>EventPublisher: ParsingFailed
	end
```
