docs/diagrams/parse-page-failed.puml
@startuml

title Series import flow: stage 3a (handle error of parsing page)

participant ParsingFailedEventListener
participant SeriesImportService

ParsingFailedEventListener->SeriesImportService:
activate SeriesImportService
SeriesImportService->ParsingFailedEventListener:
deactivate SeriesImportService
note right of SeriesImportService: DownloadingSucceeded -> ParsingFailed

@enduml
