docs/import-series-flow.md
```mermaid
sequenceDiagram
	title Series import flow: stage 3a (handle error of parsing page)

	participant ParsingFailedEventListener
	participant SeriesImportService

	ParsingFailedEventListener->>SeriesImportService: 
	activate SeriesImportService
	SeriesImportService->>ParsingFailedEventListener: 
	deactivate SeriesImportService
	note right of SeriesImportService: DownloadingSucceeded -> ParsingFailed
```
