docs/import-series-flow.md
```mermaid
sequenceDiagram
	title Series import flow: stage 4 (import a series)

	participant Browser
	participant SeriesImportController
	participant SeriesImportService
	participant SeriesSalesImportService
	participant SeriesService
	participant ParticipantService

	note over Browser,SeriesImportController: show info about import request
	opt GET /series/import/request/{id}
	Browser->>SeriesImportController: 
	activate SeriesImportController
	SeriesImportController->>SeriesImportService: requestId
	activate SeriesImportService
	SeriesImportService->>SeriesImportController: ImportRequestDto
	deactivate SeriesImportService
	SeriesImportController->>SeriesImportService: requestId
	activate SeriesImportService
	SeriesImportService->>SeriesImportController: SeriesParsedDataDto
	deactivate SeriesImportService
	SeriesImportController->>SeriesSalesImportService: requestId
	activate SeriesSalesImportService
	SeriesSalesImportService->>SeriesImportController: SeriesSaleParsedDataDto
	deactivate SeriesSalesImportService
	SeriesImportController->>Browser: ImportRequestDto<br/>ImportSeriesForm<br/>ImportSellerForm<br/>ImportSeriesSalesForm
	deactivate SeriesImportController
	end

	note over Browser,SeriesImportController: import a series
	opt POST /series/import/request/{id}
	Browser->>SeriesImportController: ImportSeriesForm
	activate SeriesImportController
	SeriesImportController->>SeriesImportService: AddSeriesDto<br/>AddParticipantDto<br/>AddSeriesSalesDto
	activate SeriesImportService
	opt Create a series
	SeriesImportService->>SeriesService: AddSeriesDto
	activate SeriesService
	SeriesService->>SeriesImportService: seriesId
	deactivate SeriesService
	end
	opt Create a seller (optional)
	SeriesImportService-->>ParticipantService: AddParticipantDto
	activate ParticipantService
	ParticipantService-->>SeriesImportService: sellerId
	deactivate ParticipantService
	end
	opt Create a series sale (optional)
	SeriesImportService-->>SeriesSalesImportService: AddSeriesSalesDto
	activate SeriesSalesImportService
	SeriesSalesImportService-->>SeriesImportService: 
	deactivate SeriesSalesImportService
	end
	SeriesImportService->>SeriesImportController: seriesId
	deactivate SeriesImportService
	note right of SeriesImportService: ParsingSucceeded -> ImportSucceeded
	SeriesImportController->>Browser: redirect to /series/{id}
	deactivate SeriesImportController
	end
```
